'use strict';

//Итак, фреймворки. В чем отличие фреймворков от библиотек?
//Что библиотеки, что фреймворки - это написанные куски кода, которые упрощают нам работу.
//Если же библиотеки это просто набор инструментов, которые можем использовать когда угодно и сколько угодно, да и вообще в любом участке кода
//То фреймворки это система из таких интсрументов или даже философия построения приложений
//Грубо говоря, библиотеки дают нам больше свободы в использовании, а фреймворки дают систему, от которой нельзя отступать
//Но это не значит, что фреймворки плохи. Наоборот, на фреймворках написано дохуя приложух и очень крутых.
//Щас самые популяные фреймфорки это Angular (от google), Vue (от интузиастов) и React (от facebook)

//Angular: 
// - node.js
// - typescript 
// - webpack
// - MVC pattern (Шаблон проектирования приложений)
// - сам angular

//React:
// - препроцессор JSX
// - Babel
// - Webpack
// - React.js

//Vue:
// - Webpack
// - Vue.js