'use strict';

//npm (пакетный менеджер) простыми словами это куски кода, которые лежатгле-то на серваках и которые мы можем использовать для облегчения нашего кода
//Сейчас я просто так для примера усьановил package jaon для проверки, но лучше это тестить на отделных проектах
//Так как это куски кода, которые помогают нам в работе, то мы их не трогаем, иначе может все полететь
//Такие папки как node modules могут весить по гигу или больше и когда мы пушим их в наш репозиторий, лучше использовать gitignore
//чтобы эти огромные папки не пушились, а когда другой человек клонирует ваш проект, то он просто в терминале прописывает npm i и все